Cannot convert temperature '[Temperate Value]' to double value
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
 Syntax
  C#
public static FailureDefinitionId CannotConvertTempToDouble { get; }
  Visual Basic
Public Shared ReadOnly Property CannotConvertTempToDouble As FailureDefinitionId
	Get
  Visual C++
public:
static property FailureDefinitionId^ CannotConvertTempToDouble {
	FailureDefinitionId^ get ();
}
 See Also
  BuiltInFailures ConversionFailures Class
  Autodesk.Revit.DB Namespace